#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.google_compute_image.os_image: Reading...
google_compute_router.nat_router[0]: Refreshing state... [id=projects/local-llm-test-486215/regions/us-central1/routers/llm-server-dev-nat-router]
google_compute_firewall.spot_instance[0]: Refreshing state... [id=projects/local-llm-test-486215/global/firewalls/llm-server-dev-firewall]
google_compute_router_nat.nat[0]: Refreshing state... [id=local-llm-test-486215/us-central1/llm-server-dev-nat-router/llm-server-dev-nat]
data.google_compute_image.os_image: Read complete after 1s [id=projects/debian-cloud/global/images/debian-12-bookworm-v20260114]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.spot_instance will be created
  + resource "google_compute_instance" "spot_instance" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + effective_labels          = {
          + "cost_center" = "research"
          + "deployed_by" = "github-actions"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "purpose"     = "llm-development"
          + "team"        = "engineering"
        }
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + labels                    = {
          + "cost_center" = "research"
          + "deployed_by" = "github-actions"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "purpose"     = "llm-development"
          + "team"        = "engineering"
        }
      + machine_type              = "a2-ultragpu-2g"
      + metadata                  = {
          + "block-project-ssh-keys" = "true"
          + "ssh-keys"               = ""
          + "startup-script"         = <<-EOT
                #!/bin/bash
                set -e
                export DEBIAN_FRONTEND=noninteractive
                
                # Update system
                apt-get update
                apt-get install -y \
                  apt-transport-https \
                  ca-certificates \
                  curl \
                  gnupg \
                  lsb-release \
                  pciutils \
                  linux-headers-$(uname -r)
                
                # Install NVIDIA drivers for A100 GPU (skip if already working)
                if ! nvidia-smi &> /dev/null; then
                  echo "NVIDIA drivers not loaded, installing/configuring..."
                
                  # Add CUDA repository if not present
                  if [ ! -f /etc/apt/sources.list.d/cuda.list ]; then
                    curl -fsSL https://developer.download.nvidia.com/compute/cuda/repos/debian12/x86_64/3bf863cc.pub | \
                      gpg --dearmor -o /usr/share/keyrings/cuda-archive-keyring.gpg
                    echo "deb [signed-by=/usr/share/keyrings/cuda-archive-keyring.gpg] https://developer.download.nvidia.com/compute/cuda/repos/debian12/x86_64 /" > /etc/apt/sources.list.d/cuda.list
                    apt-get update
                  fi
                
                  # Install drivers if not present
                  if ! dpkg -l | grep -q nvidia-driver; then
                    echo "Installing NVIDIA drivers..."
                    apt-get install -y cuda-drivers
                  fi
                
                  # Load the nvidia kernel module if not loaded
                  if ! lsmod | grep -q nvidia; then
                    echo "Loading NVIDIA kernel modules..."
                    modprobe nvidia
                  fi
                else
                  echo "NVIDIA drivers already loaded and working"
                fi
                
                # Install NVIDIA Container Toolkit for Docker GPU support (skip if already installed)
                if ! command -v nvidia-ctk &> /dev/null; then
                  echo "Installing NVIDIA Container Toolkit..."
                  curl -fsSL https://nvidia.github.io/libnvidia-container/gpgkey | \
                    gpg --dearmor -o /usr/share/keyrings/nvidia-container-toolkit-keyring.gpg
                
                  LIST_FILE="/etc/apt/sources.list.d/nvidia-container-toolkit.list"
                  TMP_LIST="$(mktemp)"
                
                  curl -fsSL "https://nvidia.github.io/libnvidia-container/stable/deb/nvidia-container-toolkit.list" \
                    | sed 's#deb https://#deb [signed-by=/usr/share/keyrings/nvidia-container-toolkit-keyring.gpg] https://#g' \
                    > "$TMP_LIST"
                
                  if ! grep -qE '^deb\s' "$TMP_LIST"; then
                    echo "ERROR: NVIDIA repo list download did not look like an apt source list (possible HTML/error page)." >&2
                    head -n 20 "$TMP_LIST" >&2 || true
                    exit 1
                  fi
                
                  mv "$TMP_LIST" "$LIST_FILE"
                  apt-get update
                  apt-get install -y nvidia-container-toolkit
                else
                  echo "NVIDIA Container Toolkit already installed, skipping"
                fi
                
                # Install Docker (skip if already installed)
                if ! command -v docker &> /dev/null; then
                  echo "Installing Docker..."
                  curl -fsSL https://get.docker.com -o get-docker.sh
                  sh get-docker.sh
                else
                  echo "Docker already installed, skipping"
                fi
                
                # Configure Docker to use NVIDIA runtime (idempotent)
                nvidia-ctk runtime configure --runtime=docker
                systemctl restart docker
                
                # Verify GPU is accessible (wait for drivers to load)
                echo "Waiting for GPU drivers to initialize..."
                for i in {1..30}; do
                  if nvidia-smi; then
                    echo "GPU initialized successfully"
                    break
                  fi
                  echo "Waiting for GPU drivers to load... ($i/30)"
                  sleep 2
                done
                
                # Pull and run Ollama with GPU support (skip if already running)
                if ! docker ps | grep -q ollama; then
                  echo "Starting Ollama container..."
                  # Remove stopped container if it exists
                  docker rm -f ollama 2>/dev/null || true
                  docker run -d \
                    --gpus all \
                    --name ollama \
                    --restart always \
                    -p 11434:11434 \
                    -v /var/lib/ollama:/root/.ollama \
                    ollama/ollama
                  # Wait for Ollama to start
                  sleep 15
                else
                  echo "Ollama container already running, skipping"
                fi
                
                # Note: Models will be pulled manually after instance is ready
                # gpt-oss:120b (65GB) and MiniMax-M2.1 Q4_K_M (130GB)
                echo "Instance ready. Pull models manually:"
                echo "  ollama pull gpt-oss:120b"
                echo "  ollama pull hf.co/John1604/MiniMax-M2.1-gguf:q4_k_m"
                
                
                # Log completion
                echo "LLM server with A100 GPU setup completed at $(date)" >> /var/log/llm-setup.log
                echo "GPU Info:" >> /var/log/llm-setup.log
                nvidia-smi >> /var/log/llm-setup.log
            EOT
        }
      + metadata_fingerprint      = (known after apply)
      + metadata_startup_script   = <<-EOT
            #!/bin/bash
            set -e
            export DEBIAN_FRONTEND=noninteractive
            
            # Update system
            apt-get update
            apt-get install -y \
              apt-transport-https \
              ca-certificates \
              curl \
              gnupg \
              lsb-release \
              pciutils \
              linux-headers-$(uname -r)
            
            # Install NVIDIA drivers for A100 GPU (skip if already working)
            if ! nvidia-smi &> /dev/null; then
              echo "NVIDIA drivers not loaded, installing/configuring..."
            
              # Add CUDA repository if not present
              if [ ! -f /etc/apt/sources.list.d/cuda.list ]; then
                curl -fsSL https://developer.download.nvidia.com/compute/cuda/repos/debian12/x86_64/3bf863cc.pub | \
                  gpg --dearmor -o /usr/share/keyrings/cuda-archive-keyring.gpg
                echo "deb [signed-by=/usr/share/keyrings/cuda-archive-keyring.gpg] https://developer.download.nvidia.com/compute/cuda/repos/debian12/x86_64 /" > /etc/apt/sources.list.d/cuda.list
                apt-get update
              fi
            
              # Install drivers if not present
              if ! dpkg -l | grep -q nvidia-driver; then
                echo "Installing NVIDIA drivers..."
                apt-get install -y cuda-drivers
              fi
            
              # Load the nvidia kernel module if not loaded
              if ! lsmod | grep -q nvidia; then
                echo "Loading NVIDIA kernel modules..."
                modprobe nvidia
              fi
            else
              echo "NVIDIA drivers already loaded and working"
            fi
            
            # Install NVIDIA Container Toolkit for Docker GPU support (skip if already installed)
            if ! command -v nvidia-ctk &> /dev/null; then
              echo "Installing NVIDIA Container Toolkit..."
              curl -fsSL https://nvidia.github.io/libnvidia-container/gpgkey | \
                gpg --dearmor -o /usr/share/keyrings/nvidia-container-toolkit-keyring.gpg
            
              LIST_FILE="/etc/apt/sources.list.d/nvidia-container-toolkit.list"
              TMP_LIST="$(mktemp)"
            
              curl -fsSL "https://nvidia.github.io/libnvidia-container/stable/deb/nvidia-container-toolkit.list" \
                | sed 's#deb https://#deb [signed-by=/usr/share/keyrings/nvidia-container-toolkit-keyring.gpg] https://#g' \
                > "$TMP_LIST"
            
              if ! grep -qE '^deb\s' "$TMP_LIST"; then
                echo "ERROR: NVIDIA repo list download did not look like an apt source list (possible HTML/error page)." >&2
                head -n 20 "$TMP_LIST" >&2 || true
                exit 1
              fi
            
              mv "$TMP_LIST" "$LIST_FILE"
              apt-get update
              apt-get install -y nvidia-container-toolkit
            else
              echo "NVIDIA Container Toolkit already installed, skipping"
            fi
            
            # Install Docker (skip if already installed)
            if ! command -v docker &> /dev/null; then
              echo "Installing Docker..."
              curl -fsSL https://get.docker.com -o get-docker.sh
              sh get-docker.sh
            else
              echo "Docker already installed, skipping"
            fi
            
            # Configure Docker to use NVIDIA runtime (idempotent)
            nvidia-ctk runtime configure --runtime=docker
            systemctl restart docker
            
            # Verify GPU is accessible (wait for drivers to load)
            echo "Waiting for GPU drivers to initialize..."
            for i in {1..30}; do
              if nvidia-smi; then
                echo "GPU initialized successfully"
                break
              fi
              echo "Waiting for GPU drivers to load... ($i/30)"
              sleep 2
            done
            
            # Pull and run Ollama with GPU support (skip if already running)
            if ! docker ps | grep -q ollama; then
              echo "Starting Ollama container..."
              # Remove stopped container if it exists
              docker rm -f ollama 2>/dev/null || true
              docker run -d \
                --gpus all \
                --name ollama \
                --restart always \
                -p 11434:11434 \
                -v /var/lib/ollama:/root/.ollama \
                ollama/ollama
              # Wait for Ollama to start
              sleep 15
            else
              echo "Ollama container already running, skipping"
            fi
            
            # Note: Models will be pulled manually after instance is ready
            # gpt-oss:120b (65GB) and MiniMax-M2.1 Q4_K_M (130GB)
            echo "Instance ready. Pull models manually:"
            echo "  ollama pull gpt-oss:120b"
            echo "  ollama pull hf.co/John1604/MiniMax-M2.1-gguf:q4_k_m"
            
            
            # Log completion
            echo "LLM server with A100 GPU setup completed at $(date)" >> /var/log/llm-setup.log
            echo "GPU Info:" >> /var/log/llm-setup.log
            nvidia-smi >> /var/log/llm-setup.log
        EOT
      + min_cpu_platform          = (known after apply)
      + name                      = "llm-server-dev"
      + project                   = "local-llm-test-486215"
      + self_link                 = (known after apply)
      + tags                      = [
          + "dev",
          + "spot-instance",
        ]
      + tags_fingerprint          = (known after apply)
      + terraform_labels          = {
          + "cost_center" = "research"
          + "deployed_by" = "github-actions"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "purpose"     = "llm-development"
          + "team"        = "engineering"
        }
      + zone                      = "us-central1-c"

      + boot_disk {
          + auto_delete                = false
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image                  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-12-bookworm-v20260114"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + size                   = 300
              + type                   = "pd-ssd"
            }
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)
        }

      + scheduling {
          + automatic_restart           = false
          + instance_termination_action = "STOP"
          + on_host_maintenance         = "TERMINATE"
          + preemptible                 = true
          + provisioning_model          = "SPOT"
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }

      + shielded_instance_config {
          + enable_integrity_monitoring = true
          + enable_secure_boot          = false
          + enable_vtpm                 = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ instance_id   = "4153084922760694363" -> (known after apply)
  ~ internal_ip   = "10.128.0.6" -> (known after apply)
  ~ self_link     = "https://www.googleapis.com/compute/v1/projects/local-llm-test-486215/zones/us-central1-c/instances/llm-server-dev" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**Checkov Security Scan:** success



*Pusher: @leonids2005, Action: `pull_request`*